import {Lab} from "./types.ts";

export const labs: Lab[] = [
    {
        id: 1,
        tasks: [
            {
                id: 1,
                description: "Робота з текстом"
            },
            {
                id: 2,
                description: "Робота з текстом"
            },
            {
                id: 3,
                description: "Додавання зображення"
            },
            {
                id: 4,
                description: "Створення однорівневих списків"
            },
            {
                id: 5,
                description: "Створення багаторівневих списків"
            },
            {
                id: 6,
                description: "Посилання"
            },
            {
                id: 7,
                description: "Таблиці"
            },
            {
                id: 8,
                description: "Спеціальні символи"
            },
            {
                id: 9,
                description: "Форми"
            },
            {
                id: 10,
                description: "Зміст"
            },
        ]
    },
    {
        id: 2,
        tasks: [
            {
                id: 1,
                description: "Створення горизонтального меню за допомогою CSS"
            },
            {
                id: 2,
                description: "Додавання ефекту наведеного стану (:hover) для меню"
            },
            {
                id: 3,
                description: "Верстка блоків і адаптивне розташування елементів"
            },
            {
                id: 4,
                description: "Стилізація нумерованих і маркованих списків"
            },
            {
                id: 5,
                description: "Використання відносного та абсолютного позиціонування елементів"
            },
            {
                id: 6,
                description: "Оформлення таблиць і створення адаптивної таблиці"
            },
            {
                id: 7,
                description: "Стилізація кнопок із використанням CSS-ефектів"
            },
            {
                id: 8,
                description: "Додавання тіні до тексту для створення ефекту глибини"
            },
            {
                id: 9,
                description: "Форматування тексту за допомогою CSS"
            },
            {
                id: 10,
                description: "Використання градієнтного фону у веб-сторінці"
            },
            {
                id: 11,
                description: "Додавання ефекту згасання для зображень при наведенні"
            },
            {
                id: 12,
                description: "Створення об’ємного ефекту для контейнера з використанням тіні"
            },
            {
                id: 13,
                description: "Реалізація вкладок (таби) за допомогою CSS"
            },
            {
                id: 14,
                description: "Заміна стандартних маркерів списку на кастомні іконки"
            },
            {
                id: 15,
                description: "Підключення рукописного шрифту з Google Fonts та його застосування"
            }
        ]
    },
    {
        id: 3,
        tasks: []
    },
    {
        id: 4,
        tasks: []
    },
    {
        id: 5,
        tasks: []
    },
    {
        id: 6,
        tasks: []
    },
]